Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/environment/waste_management_and_recycling/recycling_services.html.txt.tmx
Source language: en
Languages: ga

source: Recycling services and waste management
ga: Seirbhísí athchúrsála agus bainistíocht dramhaíola

source: The Department of Communications, Climate Action and Environment has overall responsibility for recycling and waste management
ga: Tá freagracht fhoriomlán ar an Roinn Cumarsáide, Gníomhaithe ar son na hAeráide agus Comhshaoil as athchúrsáil agus bainistíocht dramhaíola

source: For non-hazardous waste, there are 3 regions for the purposes of waste management planning: Southern, Eastern-Midlands and Connacht-Ulster
ga: I gcás dramhaíola nach bhfuil guaiseach, tá 3 réigiún freagrach as pleanáil i leith bhainistíocht dramhaíola: Deisceart, Oirthear-Lár agus Connacht-Uladh

source: The local authorities are responsible for:
ga: Tá na húdaráis áitiúla freagrach as an méid a leanas:

source: • Authorisation and control of commercial waste collection activities
ga: • Gníomhaíochtaí bailithe dramhaíl tráchtála a údarú agus a rialú

source: • Authorisation of waste exports and monitoring of internal movements of hazardous wastes
ga: • Easpórtálacha dramhaíola a údarú agus monatóireacht a dhéanamh ar ghluaiseachtaí inmheánacha de dhramhaíl ghuaiseach

source: • Waste permits for small-scale recovery and disposal activities
ga: • Ceadanna dramhaíola do ghníomhaíochtaí beagscála aisghabhála agus diúscartha

source: • Ensuring adequate waste collection, recovery and disposal arrangements in their areas
ga: • A chinntiú go bhfuil socruithe leordhóthanach bailithe, aisghabhála agus diúscartha dramhaíola i bhfeidhm ina limistéir

source: • Monitoring and inspection of waste activities generally
ga: • Monatóireacht agus cigireacht a dhéanamh ar ghníomhaíochtaí dramhaíola go ginearálta

source: They arrange for the provision of domestic refuse services and the recycling of domestic waste, which avoids sending waste to landfill
ga: Déanann údaráis áitiúla socruithe chun seirbhísí bruscar tí agus athchúrsáil dramhaíl tí a sholáthar

source: Both the EPA and local authorities have to keep registers detailing a wide range of their activities in the area of waste management
ga: Tá ar údaráis áitiúla agus an GCC cláir a choimeád ina sonraítear réimse fairsing dá ngníomhaíochtaí i limistéar na bainistíochta dramhaíola

source: The public can inspect these registers free of charge
ga: Féadfaidh an pobal súil a chaitheamh ar na cláir seo saor in aisce

source: Waste from Electrical and Electronic Equipment (WEEE) is the responsibility of retailers and local authorities, who facilitate the recycling of WEEE
ga: Tá miondíoltóirí agus údaráis áitiúla freagrach as dramhthrealamh Leictreach agus Leictreonach (DTLL), a éascaíonn DTLL a athchúrsáil

source: Under the European Union (Household Food Waste and Bio-waste) Regulations 2015, all householders (except in very small population areas or on small islands) have to do one of the following with their food waste:
ga: Faoi Rialacháin an Aontais Eorpaigh (Dramhbhia Tí agus Bithdhramhaíl), 2015, tá ar gach teaghlach (seachas i gceantair ina bhfuil daonraí an-bheaga nó ar oileáin bheaga) ceann amháin den mhéid a leanas a dhéanamh lena ndramhbhia:

source: • Segregate it and make it available for separate collection
ga: • Í a dheighilt ón dramhaíl eile agus a chur amach le bailiú ar leithligh

source: • Compost it at home (while ensuring that it does not cause smells or nuisance)
ga: • Í a mhúiríniú sa bhaile (gan núis nó drochbholadh)

source: • Bring it to an authorised facility for composting or other suitable treatment
ga: • Í a thabhairt chuig áis údaraithe ina ndéantar múiríniú no cóireáil eile atá cuí uirthi

source: It is illegal to burn household or garden waste at home or in your garden
ga: Tá sé in aghaidh an dlí dramhaíl tí nó ghairdín a dhó sa bhaile nó i do ghairdín

source: There are specific regulations that cover disposing of an end-of-life vehicle as waste
ga: Tá rialacháin ar leith ann a dhéanann soláthar do dhramhaíl ó fheithicil a bhfuil a ré caite aici a dhiúscairt, ar nós gluaisteáin

source: There is an environmental levy on plastic shopping bags
ga: Gearrtar tobhach comhshaoil ar mhálaí plaisteacha siopadóireachta

source: Retailers must pass on the full amount of the levy as a charge to customers at the checkout
ga: Ní mór do mhiondíoltóirí méid iomlán an tobhaigh a ghearradh ar chustaiméirí ag an gcuntar amach

source: Revenue generated from the levy goes into the Environmental Fund to support waste management, litter and other environmental initiatives
ga: Cuirtear ioncam a ghineann an tobhach leis an gCiste Comhshaoil chun tacú le bainistíocht dramhaíola agus le tionscnaimh bhruscair agus chomhshaoil eile

source: Tax relief on waste charges ended with effect from January 2012 and can no longer be claimed
ga: Cuireadh deireadh leis an bhfaoiseamh cánach ar mhuirir dhramhaíola le héifeacht ó Eanáir 2012 agus ní féidir é a éileamh a thuilleadh

source: For background information on waste management issues, see our document on waste management legislation
ga: Faigh tuilleadh eolais mar gheall ar chúrsaí bainistíochta dramhaíola inár gcáipéis ar reachtaíocht bhainistíochta dramhaíola
